# ТИПЫ ПЕРЕМЕННЫХ
# №1. Переменные представляют собой ячейки, которые могут быть использованны для хранения данных
# №1. Переменные могут хранить разные типы данных
# Что бы сохранить определенный тип данных в переменную, необязательно их указывать
# Достаточно лишь написать знак "=" ввести данные


a = 10  # INTEGER
b = 58.5  # FLOAT
c = "Hello_Привет_!@#$%^&"  # STRING
d = True  # BOOLEAN
e = False  # BOOLEAN


# integer / int  - тип данных для хранения ЦЕЛЫХ чисел
    # integer может хранить также и отрицательные числа
# float - тип данных для хранения ДРОБНЫХ чисел
    # float позволяет сохранять также и отрицательные числа
    # float может хранить прктически бесконечное кол-во цифр после точки, но
    # выведет лишь первые 17
# string / str - тип данных для хранения ТЕКСТОВЫХ данных
    # string позволяет сохранить в себе любой символ
# boolean / bool - тип данных для хранений логических ответов
    # TRUE - ответ если какая либо операция явяляется верной
    # FALSE - ответ если какая либо операция явяляется НЕ верной
